game-bot/src/Enums/РежимРаботыБота/РежимРаботыБота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимРаботыБота</name>
  <enumValues>
    <name>Эхо</name>
  </enumValues>
  <enumValues>
    <name>ПростаяВикторина</name>
  </enumValues>
  <enumValues>
    <name>СлучайнаяФотография</name>
  </enumValues>
  <enumValues>
    <name>КурсыВалют</name>
  </enumValues>
  <enumValues>
    <name>НашаПрогаМарс</name>
  </enumValues>
</mdclass:Enum>

game-bot/src/CommonModules/ИнтеграцияТелеграмПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПриОбработкеЭлементаОчереди(ЭлементОчередиОбъект, ДанныеЭлемента) Экспорт
	
	РежимРаботы = Константы.РежимРаботыБота.Получить();
	
	Если РежимРаботы = Перечисления.РежимРаботыБота.Эхо Тогда
		ТелеграмЭхо.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.ПростаяВикторина Тогда
		ТелеграмПростаяВикторина.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);  
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.ПогодаАрх Тогда
		ТелеграмПогодаАрх.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.ТелеграмНаса Тогда
		ТелеграмНаса.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.СлучайнаяФотография Тогда
		ТелеграмСлучайноеФото.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.КурсыВалют Тогда
		ТелеграмКурсыВалют.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.НашаПрогаМарс Тогда
		ТелеграмМарсКартинка.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	Иначе
		ВызватьИсключение "Не указан режим работы бота";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
